OdGiContext.multiplyByBlockLinetypeScales
\details
Controls processing of line type scales.

OdGiContext.xrefPropertiesOverride
\details
Controls overriding of Xref properties.

OdGiContext.antiAliasingMode
\details
Receives rendering anti-aliasing settings.
\returns
0.

OdGiContext.getSectionGeometryManager
\details
Retrieves the interface for accessing section geometry functionality.
\returns
smart pointer to the OdGiSectionGeometryManager instance.

OdGiContext.displayModelerSilhouettes
\details
Checks whether generation of silhouettes is enabled for modeler geometry.
\returns
true if generation of silhouettes is enabled for modeler geometry.

OdGiContext.displayMeshSilhouettes
\details
Checks whether generation of silhouettes is enabled for mesh primitives on Gi side.
\returns
true if generation of silhouettes is enabled for mesh primitives on Gi side, false otherwise.

OdGiContext.displaySilhouettes
\details
Retrieves a silhouette type.
\returns
silhouette type as OdUInt32 value.

OdGiContext.getStubByMaterialId(OdRxObject*,System.UInt64!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Converts a material id into an Object ID. This method may check that converted Object ID is really material.
\param pBaseDb [in]  Pointer to a database.
\param materialId [in]  Material identifier.
\returns
pointer to a converted object identifier.

OdGiContext.getStubByMatName(OdRxObject*,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Converts a material name into an Object ID.
\param pBaseDb [in]  Pointer to a database where to search for material name.
\param strMatName [in]  Material name.
\returns
pointer to the identifier of owner object.

OdGiContext.getOwnerIDByStub(OdDbStub*)
\details
Retrieves the Owner Object ID of the specified Object ID.
\param objectId [in]  Object ID.
\returns
pointer to the identifier of owner object.

OdGiContext.getDatabaseByStub(OdDbStub*)
\details
Retrieves the database of an Object ID.
\param objectId [in]  Object ID.
\returns
pointer to the database of the specified object identifier.

OdGiContext.getIDByStub(OdDbStub*)
\details
Converts an Object ID to an object handle (database persistent ID).
\param objectId [in]  Object ID.

OdGiContext.getStubByID(System.UInt64)
\details
Converts an object handle into an Object ID.
\param persistentId [in]  Object handle.
\returns
converted object identifier.

OdGiContext.plotStyle(OdDbStub*,OdPsPlotStyleData*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the PaperSpace PlotStyle data for this vectorization.
\param objectId [in]  Object ID of plot style.
\param plotStyleData [out]  Receives the PlotStyle data.

OdGiContext.plotStyle(System.Int32,OdPsPlotStyleData*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the PaperSpace PlotStyle data for this vectorization.
\param penNumber [in]  Pen number.
\param plotStyleData [out]  Receives the PlotStyle data.
\param objectId [in]  Object ID of plot style.

OdGiContext.plotStyleType
\details
Retrieves the plot style type of this Context object.
\returns
returns one of the following:
Name          Value
kPsNone       0
kPsByColor    1
kPsByName     2

OdGiContext.regenAbort
\details
Checks whether this vectorization process should be aborted.
\returns
true if this vectorization process should be aborted.

OdGiContext.drawableFilterFunction(System.Int64,OdGiPathNode!System.Runtime.CompilerServices.IsConst*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Retrieves the set of flags for the drawable filtration function (will be called for each drawable vectorization).
\param functionId [in]  Internal drawable filtration function ID.
\param pPathNode [in]  Currently vectorizing path node pointer.
\param nFlags [in]  Set of input flags.
\returns
0 to continue vectorization or kSkipVectorization to skip it.

OdGiContext.drawableFilterFunction(System.Int64,OdGiDrawable!System.Runtime.CompilerServices.IsConst*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Retrieves the set of flags for the drawable filtration function (will be called for each drawable vectorization).
\param functionId [in]  Internal drawable filtration function ID.
\param pDrawable [in]  Currently vectorizing drawable pointer.
\param nFlags [in]  Set of input flags.
\returns
0.

OdGiContext.drawableFilterFunctionId(OdDbStub*)
\details
Retrieves internal drawable filtration function ID. Must be implemented in derived classes.
\param viewportId [in]  Pointer to the Object ID of the Viewport object to be queried.
\returns
0.

OdGiContext.customViewportGeometryCS(OdGiContext.CoordinatesSystem)
\details
Specifies behavior of OdGiViewportGeometry::polylineEye/polygonEye/polylineDc/polygonDc methods.
\param csType [in]  If specified kECS - return coordinates system for polylineEye/polygonEye methods.
If specified kNDC or kDCS - return coordinates system for polylineDc/polygonDc methods.
Other argument types ingored and return coordinates system as is (kWCS for kWCS for example).
\returns
Coordinates system for specified input coordinates system type.

OdGiContext.selectionStyle(System.UInt32!System.Runtime.CompilerServices.IsLong,OdGiSelectionStyle*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the selection styles for entities highlighting.
\param nStyle [in]  Selection style index.
\param selStyle [out]  Receives the selection style data.
\returns
Number of selection styles provided by this context object.
\remarks
This method should return at least single selection style for 0 index.

OdGiContext.glyphSize(OdGiContext.GlyphType)
\details
Retrieves the glyph size for the specified glyph type.
\param glyphType [in]  Type of glyph to return glyph size for.
\returns
Retrieves a value in the range [0,100].
The default return values are the following:
Name         Value
kLightGlyph  0
kCameraGlyph 50

OdGiContext.fadingIntensityPercentage(OdGiContext.FadingType)
\details
Retrieves Fading intensity percentage.
\param fadingType [in]  Fading type.
\returns
50 if fading type isn't kRefEditFade, 70 is returned otherwise.

OdGiContext.imageSelectionBehavior
\details
Retrieves a set of flags that describe image behavior during selection.
\returns
Set of ImageSelectionFlags enumeration bit flags.

OdGiContext.imageQuality
\details
Retrieves the image quality for this vectorization process.
\returns
Image quality as a value of ImageQuality enumeration.

OdGiContext.getAnnotationScale(OdDbStub*)
\details
Retrieves inverse of scale for specified viewport.
\param viewportId [in]  Pointer to the Object ID of the Viewport object to be queried.
\returns inverse of viewport scale.

OdGiContext.useTtfTriangleCache
\details
Retrieves true if and only if triangle cache for ttf fonts is enabled for this vectorization process.
\returns
true if triangle cache for ttf fonts is enabled for this vectorization process.

OdGiContext.quickTextMode
\details
Retrieves true if and only if quick text mode is enabled for this vectorization process.
\returns
true if quick text mode is enabled for this vectorization process, false otherwise.

OdGiContext.fillMode
\details
Checks whether shell/mesh geometry primitives should be filled during this vectorization.
\returns
true if shell/mesh geometry primitives should be filled, false otherwise.

OdGiContext.numberOfIsolines
\details
Retrieves the number of isolines to be drawn on surfaces during this vectorization.
\returns
number of isolines as OdUInt32 value.

OdGiContext.fillTtf
\details
Checks whether TrueType text should be filled during this vectorization.
\returns
true if TrueType text should be filled during this vectorization, false otherwise.

OdGiContext.paletteBackground
\details
Retrieves the palette background color.
\returns
palette background color as ODCOLORREF definition.

OdGiContext.isPlotGeneration
\details
Checks whether this vectorization is intended for hard copy output.
\returns
true if this vectorization is intended for hard copy output, false otherwise.

OdGiContext.circleZoomPercent(OdDbStub*)
\details
Retrieves the circle zoom percent for this vectorization process.
\param viewportId [in]  Pointer to the Object ID of the Viewport object to be queried.
\returns
Retrieves a value in the range [1,20000]. 100 is the default.

OdGiContext.shapeExtentsBox(OdGiTextStyle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the extents box for the specified shape.
\param textStyle [in]  TextStyle for the shape.
\param shapeNumber [in]  Number of a shape. Shape is a single character of a special SHX font. This function returns the number of that character.
\param min [out]  Receives the lower-left corner of the extents box.
\param max [out]  Receives the upper-right corner of the extents box.

OdGiContext.textExtentsBox(OdGiTextStyle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt16!System.Runtime.CompilerServices.IsConst*,System.Int32,System.UInt32!System.Runtime.CompilerServices.IsLong,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*)
\details
Retrieves the extents box for the specified text.
\param textStyle [in]  TextStyle for msg.
\param msg [in]  Pointer to an array of characters.
\param nLength [in]  Message length.
\param flags [in]  Vectorization flags.
\param min [out]  Receives the lower-left corner of the extents box.
\param max [out]  Receives the upper-right corner of the extents box.
\param pEndPos [out]  If non-NULL, receives the end position of the text string.

OdGiContext.drawText(OdGiConveyorGeometry*,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt16!System.Runtime.CompilerServices.IsConst*,System.Int32!System.Runtime.CompilerServices.IsLong,System.Boolean,OdGiTextStyle!System.Runtime.CompilerServices.IsConst*,OdGeVector3d!System.Runtime.CompilerServices.IsConst*)
\details
Vectorizes the specified text string to the supplied CommonDraw object.
\param pDest [in]  Pointer to the Conveyor object.
\param position [in]  Position of the text.
\param direction [in]  Baseline direction for the text.
\param upVector [in]  Up vector for the text.
\param msg [in]  Text string.
\param numBytes [in]  Number of bytes in msg (not including the optional null byte).
\param raw [in]  If and only if true, escape sequences, such as %%P, will not be converted to special characters.
\param pTextStyle [in]  Pointer to the TextStyle for msg.
\param pExtrusion [in]  Pointer to the extrusion vector for the text.

OdGiContext.drawText(OdGiCommonDraw*,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double,System.Double,System.Double,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Vectorizes the specified text string to the supplied CommonDraw object.
\param pDraw [in]  Pointer to the CommonDraw object.
\param position [in]  Position of the text.
\param height [in]  Height of the text.
\param width [in]  Width of the text.
\param oblique [in]  Oblique angle of the text.
\param msg [in]  Text message.
\remarks
All angles are expressed in radians.
As currently implemented, this function ignores width and oblique.
They will be fully implemented in a future release.

OdGiContext.drawText(OdGiCommonDraw*,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt16!System.Runtime.CompilerServices.IsConst*,System.Int32!System.Runtime.CompilerServices.IsLong,OdGiTextStyle!System.Runtime.CompilerServices.IsConst*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Vectorizes the specified text string to the supplied CommonDraw object.
\param pDraw [in]  Pointer to the CommonDraw object.
\param position [in]  Position of the text.
\param msg [in]  Text string.
\param numBytes [in]  Number of bytes in msg (not including the optional null byte).
\param pTextStyle [in]  Pointer to the TextStyle for msg.
\param flags [in]  Vectorization flags.
\remarks
msg must be null terminated if numBytes is not supplied.

OdGiContext.drawShape(OdGiConveyorGeometry*,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32,OdGiTextStyle!System.Runtime.CompilerServices.IsConst*,OdGeVector3d!System.Runtime.CompilerServices.IsConst*)
\details
Vectorizes the specified shape.
\param pDest [in]  Pointer to the Conveyor object.
\param position [in]  Position of a shape.
\param direction [in]  Baseline direction for the text.
\param upVector [in]  Up vector for the text.
\param shapeNumber [in]  Number of shape to draw. Shape is a single character of a special SHX font. This function returns the number of that character.
\param pTextStyle [in]  Pointer to the text style applied to a shape.
\param pExtrusion [in]  Pointer to the Extrusion vector for the text.

OdGiContext.drawShape(OdGiCommonDraw*,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32,OdGiTextStyle!System.Runtime.CompilerServices.IsConst*)
\details
Vectorizes the specified shape to the specified interface object.
\param pDraw [in]  Pointer to the CommonDraw object.
\param position [in]  Position of the shape.
\param shapeNumber [in]  Shape number.
\param pTextStyle [in]  Pointer to the TextStyle for the shape.

OdGiContext.getDefaultTextStyle(OdGiTextStyle*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the default text style associated with this Context object.
\param textStyle [out]  Receives the TextStyle object.

OdGiContext.commonLinetypeScale
\details
Retrieves the common linetype scale for this Context object.
\returns
common scale of linetypes.

OdGiContext.defaultLineWeight
\details
Retrieves the default lineweight associated with this Context object.
\returns
the values from the OdDb::LineWeight enumeration that represent lineweight configurations.

OdGiContext.openDrawable(OdDbStub*)
\details
Opens for reading the specified drawable object that belongs to the database associated with this Context object.
\param drawableId [in]  Object ID of the drawable to be opened.
\returns
Retrieves a SmartPointer to the drawable object.

OdGiContext.database
\details
Retrieves the database that is currently being vectorized.
\returns
pointer to the database being vectorized.